<template>
<div align="center">
<div class="frame" style="max-width:100%">
<h2>ポートフォリオ作った</h2>
<div style="font-size:12px display:inline">2018/7/12/1:22</div>
<router-link to="../blog">戻る</router-link>
<div class="passage" align="left">
<hr>
書き途中
<!--
〜ゆいブログができるまで〜<br>
<br>
作ったっていうか途中ですが、ようやくウェブサイトができた<br>
早速なのでブログをかきかき
<h3>モチベ</h3>
目的としては大体就活がメインだけど、クリエイターぽく作品集をババーンできるサイト欲しいし、知識をアウトプットとかしたい。既存エンジンでもできるけど、せっかくなら自分で作りたいよね<br>

<h3>紆余曲折</h3>
無から1を作るのが結構苦労した。とりあえず叩き台を作る。
https://twitter.com/highsate/status/1005896663339130881
<br>
最低限、メニューが開けて作品が見れればOK.
<br>

そういえばトップに
<h3>所感</h3>
最高〜〜

<h3>今後やること</h3>
<li>引っ越し
<ul>
いきなりですが、ラズパイ鯖があるので引越しします。ドメインも取ってるので
</ul> </li>

<li>CSSアニメーション
<ul>
随所のUIやら画面遷移やらをいい感じにアニメーションさせる。
</ul> </li>

<li>ブログエンジン
<ul>
実はこのブログ、なんとHTML手打ちで生成されています。なんとかしたいです。
早く記事書きたかったので。。。
</ul> </li>

<li>季節毎に絵を描く
<ul>
今回の一件でお絵かきにハマったので、冬ば〜じょん描いてweb上で 
雪とか降らせてみたい
</ul> </li>



今後も宜しくお願いします。
-->
</div>
</div>


</div>
</template>
<script>
</script>
