<template>
<div align="center">
<div class="frame" style="max-width:100%">
<h2>ゆいブログができるまで</h2>
<div style="font-size:12px display:inline">2018/7/12/1:22</div>
<router-link to="../blog">戻る</router-link>
<div class="passage" align="left">
<hr>
ポートフォリオサイト、すなわち制作物を並べるサイトを作ってみました<br>
早速ブログをかきかき
<h3>モチベ</h3>
目的としては大体就活がメインだけど、作品を出せるサイト欲しいし、知識をアウトプットしたり思考の過程を残したりしたいなぁというのがある<br>
webサイトを作るのは初めてです<br>
<a href="https://jp.vuejs.org/v2/guide/index.html">vueJS</a>っていうフレームワークの勉強も兼ねてやってみました

<h3>紆余曲折</h3>
制作の経緯をちょっとだけ
<h4>叩き台</h4>
無から1を生み出すのが結構苦労しました。手を動かさないと始まらないので、ノートに雑に書いてCSSに書き起こします。<br>
<img src="../../resource/web1.png"><br>
ロゴは適当にフリーフォントから良いのを選んできました。
背景が寂しかったので左右の謎囲い線と斜め線を入れました。
叩き台なのでこれで充分。

<h4>その2</h4>
いろいろ削ってスッキリしました。配色も調整。<a href="https://twitter.com/highsate/status/1009441769199525888">メニューが開きます</a>
<img src="../../resource/web3.png"><br>
<h4>絵を描く</h4>
これはこれでシンプルながら好きだったのですが、いろんなサイトを見て、<b>絵による印象がデカい</b>ということに気づいたので描いてみようかな〜と思う<br>

<img src="../../resource/web4.png"><br>
なんとなく描いてみたら、すべてのデザインを侵食してしまった

<h4>完成</h4>
アングル変えました<br>
エモい<br>
<img src="../../resource/uyblog.png"><br>
やはり絵はいいですね<br>
初めて絵を真面目に描いてたらとても楽しかった。時間があれば背景を描き込んだりアニメーションを入れたりしたい。
<h3>今後やること</h3>
独自ドメインに移す<br>
CSSアニメーションを充実させる<br>
ブログエンジンを作る or 導入する<br>

<h3>所感</h3>
ひとまずアウトプットの場ができて落ち着いた感じです。たくさん記事書くぞ〜〜
<br>
<br>
今後も宜しくお願いします。
</div>
</div>


</div>
</template>
<script>
</script>
